[
  {
    "number": 1,
    "name": "CANDELE",
    "text_ita": "In una cappella ci sono 6 candele accese. Il cappellano ha dimenticato la finestra aperta e una folata di vento ne spegne 2. Poco dopo entrando nella stanza nota che anche un’altra candela si e’ spenta e finalmente decide di chiudere la vecchia finestra. Considerando che ora nessun’altra candela puo’ essere spenta dal vento, quante candele resteranno accese alla fine?  ",
    "text_eng": "This box is so tiny. I hate my creators...",
    "hint1_ita": "Non essere impulsivo so che la risposta puo' sembrare banale, ma se guardi attentamente il testo, vedrai che vi sono delle parole chiave.",
    "hint2_ita": "Rifletti attentamente sulle parole: “resteranno accese alla fine”",
    "hint3_ita": "La risposta e’ 0!",
    "hint1_eng": "Don't be impulsive I know the answer may seem trivial, but if you look closely at the text, you will see that there are keywords.",
    "hint2_eng": "Think carefully about the words: \"they will remain lit at the end\".",
    "hint3_eng": "The answer is 0!",
    "solution_ita": "La strega Madalina non e' riuscita ad ingannarti! Le candele si consumano con il tempo. Alla fine non ne rimarra' piu'nessuna.",
    "solution_eng": "The witch Madalina couldn't fool you! Candles wear out over time. In the end, none will remain."
  },
  {
    "number": 2,
    "name": "SENTINELLE",
    "text_ita": "Lo stratega reale si trova in gran difficolta': deve scegliere la ronda che 4 guardie devono percorrere durante la notte contemporaneamente. Ovviamente per coprire al meglio l’area da controllare, il percorso di una singola guardia non deve incrociarsi con quello di un'altra. Puoi aiutare lo stratega a disegnare i percorsi? (Clicca sullo scudo per ridisegnare il percorso di una guardia)",
    "text_eng": "The royal strategist finds himself in great difficulty: he must choose the patrol that 4 guards must travel during the night at the same time. Obviously to better cover the area, the path of a single guard must not cross with that of another. Can you help the strategist and draw the routes? (Click on the shield to redraw a route of a guard)",
    "hint1_ita": "Non sempre conviene fare la strada più corta.",
    "hint2_ita": "La sentinella blu deve passare sopra le posizioni di partenza della sentinella rossa e della sentinella verde.",
    "hint3_ita": "text",
    "hint1_eng": "It is not always advisable to take the shortest route.",
    "hint2_eng": "The blue sentinel must pass over the starting positions of the red sentry and the blue sentinel",
    "hint3_eng": "text",
    "solution_ita": "Complimenti! Hai trovato il percorso giusto, ora la zona e’ al sicuro. Sapevi che per la sentinella gialla e per quella blu si possono tracciare anche altre due strade?",
    "solution_eng": "Congratulations! You have found the right path, now the area is safe. \nDid you know that for the yellow sentinel and the blue one you can also trace two other roads?"
  },
  {
    "number": 3,
    "name": "POZIONI",
    "text_ita": "Un mago sbadato ha dovuto lasciare in fretta la sua torre per una chiamata urgente del re. Su una pergamena ha lasciato un messaggio per il suo apprendista: “Raggiungimi al castello. Mi raccomando, non dimenticare di portare con te la pozione 13!”. Aiuta l’apprendista a prendere la pozione giusta. ",
    "text_eng": "A careless wizard had to leave his tower in haste for an urgent call from the king. On a parchment, he left a message for his apprentice: \"Reach me at the castle. Please don't forget to bring potion 13 with you! \" Help the apprentice take the right potion.",
    "hint1_ita": "E’ risaputo che la fretta porta a facili errori. Voleva veramente scrivere 13?",
    "hint2_ita": "Pensa fuori dagli schemi, il 13 non simboleggia solo un numero.",
    "hint3_ita": "La soluzione e’ la Pozione B. ",
    "hint1_eng": "It is known that haste leads to easy mistakes. Did he really want to write 13?",
    "hint2_eng": "Think outside the box, 13 does not just symbolize a number.",
    "hint3_eng": "The solution is the letter B.",
    "solution_ita": "Conosco quel mago! A volte puo’ essere veramente distratto. In realta’ stava parlando della pozione B. Se guardi bene la lettera B e’ simile al numero 13.",
    "solution_eng": "I know that wizard! Sometimes he can be really distracted. He was actually talking about the potion B. If you look carefully, the letter B is similar to the number 13."
  },
  {
    "number": 4,
    "name": "RECINTO",
    "text_ita": "Un allevatore deve costruire i recinti per i suoi animali.  Sa che le MUCCHE non possono stare con i MAIALI, i MAIALI non possono stare con le PECORE, le PECORE non possono stare con i POLLI e i POLLI non possono stare con le MUCCHE. Inoltre, nel recinto non possono stare insieme animali della stessa specie o da soli e nessun recinto deve toccare gli animali. Sapresti aiutarlo a concludere il lavoro con solo quattro staccionate? Puoi premere il pulsante indietro per annullare l'ultimo recinto.",
    "text_eng": "A local farmer must fence his farm. He knows that the COWS cannot be with the PIGS, the PIGS cannot be with the SHEEPS, the SHEEPS cannot stay with the CHICKENS and the CHICKENS with the COWS. There cannot be more than one animal of the same species or alone per enclosure. The enclosure mustn't touch any animal. Can you help him finish the job with only four fences? You can presse the back button to undo the latest fence placed.",
    "hint1_ita": "Le MUCCHE devono stare con le PECORE.",
    "hint2_ita": "Se vedi una distanza maggiore tra gli animali e’ probabile che possa passarci un recinto. Prova!  ",
    "hint3_ita": "text",
    "hint1_eng": "COWS must be with the SHEEPS",
    "hint2_eng": "Where there is more distance between the animals it is probable that it will pass a fence. Why don't you try?",
    "hint3_eng": "text",
    "solution_ita": "Esatto! E' molto semplice separare gli animali dopo aver capito i vincoli con cui posizionarli. L'allevatore poteva semplicemente dire che le MUCCHE devono stare con le PECORE e i MAIALI con i POLLI. Ma la Strega Madalina ha voluto complicare le cose.",
    "solution_eng": "Exact! It is very simple to separate the animals after understanding the constraints. The breeder could have simply said that the COWS should have stayed with the SHEEP and PIGS with CHICKENS. But the Witch Madalina wanted to complicate things."
  },
  {
    "number": 5,
    "name": "120",
    "text_ita": "Un enigma tanto banale quanto complesso! Contando da 1 a 120, quante volte si ripete il numero 1? ",
    "text_eng": "Trivial, but complex at the same time: How many times is the number 1 repeated counting from 1 to 120?",
    "hint1_ita": "Fai attenzione ai numeri che vanno da 10 a 19 e da 100 a 120.",
    "hint2_ita": "Fai attenzione ai numeri che ripetono l'1 più volte come l'11 o il 111 e, in particolare, alla serie che va da 110 a 120.",
    "hint3_ita": "Il numero 1 si ripete 53 volte. ",
    "hint1_eng": "Watch out for numbers ranging from 10 to 19 and from 100 to 120.",
    "hint2_eng": "Watch out for the numbers that contain 1 more than once, like 11 or 111 and pay attention to the series that goes from 110 to 120.",
    "hint3_eng": "53 times.",
    "solution_ita": "Da 1 a 20 il numero 1 si ripete 12 volte. Da 21 a 100 altre 9 volte. Infine, da 101 a 120 bisogna considerare l’1 iniziale che si ripete per indicare il centinaio piu' il valore gia’ calcolato dei numeri che vanno da 1 a 20. Quindi per l’ultima sequenza avremo un totale di 32. Il totale finale e' di 53. ",
    "solution_eng": "You can find it twelve times between 0 and 20. Nine times between 21 and 100. Thirty two times between 100 and 120. In conclusion you will find it 53 times."
  },
  {
    "number": 6,
    "name": "ORECCHINI",
    "text_ita": "Una regina decide di regalare un orecchino e un fiore a tutte le damigelle del reame, per premiare la lealta’ che a lungo avevano dimostrato alla corona. Decide di organizzare un simpatico gioco durante una cerimonia esclusiva. Benda tutte le damigelle in modo che non possano vederla mentre mette un orecchino a ciascuna di loro. Con voce solenne annuncia: “togliete le bende e guardatevi attorno. Chi di voi vedra’ almeno 4 orecchini rossi ricevera’ una rosa blu. Altrimenti riceverete una rosa rossa”. Sapendo che le damigelle sono 10 e che solo alcune riceveranno la rosa blu, quale e’ il numero esatto di damigelle che ricevera’ una rosa rossa?",
    "text_eng": "The queen decides to give an earring and a flower to all the bridesmaids. Since they had been loyal to the crown for a long time, she decided to do it with a nice game. She makes them close their eyes and wear the earring and then says: \"Open your eyes! The ones among you that see at least 4 red earrings will receive a blue rose, otherwise it will be a red one”. Knowing that the bridesmaids are 10 and only some of them will receive the blue rose, what is the exact number of bridesmaids that get a red rose?",
    "hint1_ita": "Rifletti bene sulla parola ALCUNE.",
    "hint2_ita": "Prova per casi, inizia pensando a cosa succederebbe se le damigelle che indossano un orecchino fossero 5.",
    "hint3_ita": "La soluzione e’ 4!",
    "hint1_eng": "Think carefully about the word some.",
    "hint2_eng": "Think about every possibility. Start by thinking about what would happen if the bridesmaids wearing an earring were 5. ",
    "hint3_eng": "The solution is 4.",
    "solution_ita": "Ragionando per casi, si puo' dedurre che se le damigelle ad avere l'orecchino ROSSO fossero state meno di 4, nessuna damigella avrebbe ricevuto la rosa BLU. Se fossero state invece maggiori di 4, tutte le damigelle avrebbero ricevuto la rosa BLU. Di conseguenza le damigelle ad avere l'orecchino rosso sono 4 e sono anche quelle che riceveranno la rosa ROSSA.",
    "solution_eng": "By reasoning for cases we can deduce that if the bridesmaids that got the RED earring had been less than 4, no damsel would have received the BLUE rose. If they had been more than 4, all the bridesmaids would have received the BLUE rose. As a result there are 4 bridesmaids with a red earring and they are also the ones that will receive the RED rose."
  },
  {
    "number": 7,
    "name": "TORCE",
    "text_ita": "Nella Città Vecchia, e’ difficile muoversi di notte. Sei in grado di utilizzare il minor numero di torce per illuminare ogni strada? Fai attenzione alla posizione, anche le strade diagonali hanno bisogno di luce. Fortunatamente, una volta posizionata, una torcia riesce a illuminare tutte le strade con cui si incrocia.",
    "text_eng": "In the Old City, it is difficult to move at night. Are you able to use the fewest number of torches to light every street? Pay attention to the position, even the diagonal streets need light. Fortunately, once positioned, a torch can illuminate all the adjacent streets. ",
    "hint1_ita": "Concentrati sulle strade diagonali, possono aiutarti molto.",
    "hint2_ita": "Credo proprio che una torcia vada in alto a sinistra. Prova a vedere cosa succede.",
    "hint3_ita": "text",
    "hint1_eng": "Focus on the diagonal roads, they can help you a lot.",
    "hint2_eng": "I really believe that a torch goes on the top left corner. Try to see what happens.",
    "hint3_eng": "text",
    "solution_ita": "E’ facile illuminare le strade con tante torce. Ma per farlo solo con 5 e’ importante fare attenzione alle strade che sono vicine ai margini e cercare di posizionare non piu’ di una torcia per strada. Ora anche di notte e’ possibile muoversi in sicurezza.",
    "solution_eng": "It is easy to light the streets with lots of torches. But if you want to do it with only 5 it is important to pay attention to roads that are close to the edges and try to place no more than one torch on the road. Now even at night it is possible to move safely."
  },
  {
    "number": 8,
    "name": "CARRELLO",
    "text_ita": "Una pietra fuori posto ha intralciato il cammino di un commerciante. Il suo carretto si e’ ribaltato e tutti i beni che aveva caricato con tanta cura ora sono caduti fuori. Aiuta lo sfortunato commerciante a mettere tutto in ordine. Fai attenzione, e’ un tipo molto ordinato!",
    "text_eng": "A stone in the middle of the road has hampered the path of a merchant. His cart overturned and all the goods he had loaded so carefully now have fallen out. Help the unfortunate merchant and put everything in order. Be careful, it's a very neat guy!",
    "hint1_ita": "Le gemme vanno in basso a sinistra.",
    "hint2_ita": "Le pozioni vanno di fianco alle gemme.",
    "hint3_ita": "",
    "hint1_eng": "The gems need to be put on the bottom left side.",
    "hint2_eng": "Potions go alongside gems.",
    "hint3_eng": "",
    "solution_ita": "Alla fine non era cosi' difficile mettere in ordine ogni cosa. Il commerciante e' stato un po' pigro, ma ora puo' continuare il suo tragitto.",
    "solution_eng": "In the end, it wasn't so difficult to put everything in order. The merchant was a little lazy, but now he can continue his journey."
  },
  {
    "number": 9,
    "name": "GEMME",
    "text_ita": "Nelle segrete del castello e’ nascosto il tesoro del Re. Purtroppo, la mappa che hai trovato non e’ molto chiara. Sulla sbiadita pergamena c’e’ scritto che: il tesoro si trova a NORD della Gemma del Sole, a SUD della gemma del Mare e a EST della Gemma della Terra. Sulla mappa non e’ indicato il Nord e tu non sai quali siano le Gemme di cui parla. Riuscirai a trovare in quale forziere si trova il tesoro? ",
    "text_eng": "The treasure of the King is hidden in the dungeons of the castle. Unfortunately, the map you found is not very clear. On the faded parchment IT is written that the treasure is located NORTH of the Gem of the Sun, SOUTH of the gem of the Sea and to the East of the Gem of the Earth but the North is not indicated on the map. Can you find the treasure chest?",
    "hint1_ita": "Non lasciarti ingannare dai colori delle gemme.",
    "hint2_ita": "Dato che il tesoro si trova a sud e a nord di due gemme, dovresti poter tracciare una linea retta che passa per il forziere e le due gemme.",
    "hint3_ita": "Il forziere giusto e' il B.",
    "hint1_eng": "Don't be fooled by the colors of the gems.",
    "hint2_eng": "Since the treasure is located to the south and north of two gems, you should be able to draw a straight line passing through the chest and the two gems.",
    "hint3_eng": "Treasure is inside chest B",
    "solution_ita": "Ecco degli appunti di un vecchio esploratore. Forse ti sarebbero stati utili prima!",
    "solution_eng": "Ooops! These notes contain some information on the coordinates of the gems! Maybe they could have served you sooner."
  },
  {
    "number": 10,
    "name": "MINIERA",
    "text_ita": "Mastro Nano ha incaricato un suo minatore di trasportare i preziosi materiali trovati nelle profondità. Ma in miniera e’ difficile vedere bene le cose. Sapresti aiutarlo a sistemare i carrelli sui binari nell’ordine giusto? Trascina i carrelli per muoverli lungo i binari.",
    "text_eng": "The craftsman dwarf asked his best miners to transport the precious materials found in the depths of the mine. But down there it's hard to see things well. Can you help him arrange the carts on the tracks in the right order? Drag the carts to move them along the tracks.",
    "hint1_ita": "Clicca sull'immagine",
    "hint2_ita": "Clicca sull'immagine",
    "hint3_ita": "Clicca qui per risolvere.",
    "hint1_eng": "Click on the image.",
    "hint2_eng": "Click on the image.",
    "hint3_eng": "Click here for solve the riddle.",
    "solution_ita": "Che lavoraccio! Alla fine con qualche tentativo ce l'hai fatta.  Ci sono tanti modi per mettere in ordine i carrelli. Ma l'importante é che il lavoro sia finito.",
    "solution_eng": "Great job! In the end you made it with some attempts. The secret to solving this puzzle lies in continuing to move the carts even when they have reached their final position."
  },
  {
    "number": 11,
    "name": "LUCCHETTO",
    "text_ita": "Un libro magico e' chiuso da un lucchetto particolare. Il suo sistema di sblocco si basa sull'inserimento della giusta coppia di numeri. A destra del lucchetto ci sono 3 equazioni, ogni simbolo rappresenta un solo numero tra 1 e 9. Premi il lucchetto per cercare di sbloccarlo.",
    "text_eng": "A magic book is closed by a particular lock. Its unlocking system is based on entering the right pair of numbers. To the right of the padlock there are 3 equations, each symbol represents a single number between 1 and 9. Press the padlock to open it.",
    "hint1_ita": "La moltiplicazione della prima riga da come risultato un numero a una cifra.",
    "hint2_ita": "Prova tutti i casi ed escludi i numeri che hai gia’ trovato.",
    "hint3_ita": "La sequenza giusta e’ 8 e 6. ",
    "hint1_eng": "The multiplication of the first line results in a single-digit number",
    "hint2_eng": "Try all the cases and exclude the numbers you've already found",
    "hint3_eng": "The right sequence is 8 and 6.",
    "solution_ita": "La clessidra nella prima equazione deve corrispondere ad un numero che moltiplicato per se stesso da un numero ad una cifra (1, 2 o 3). La seconda equazione e' fatta dallo stesso numero moltiplicato per il risultato della prima equazione. Il secondo risultato ha 2 cifre. Di conseguenza l'unico numero a soddisfare questa condizione e' il 3 che moltiplicato per 9 da 27.\nA questo punto facendo un po' di tentativi si risolve anche la terza equazione, basta fare attenzione ai numeri giá assegnati agli altri simboli. Lo scudo vale 8 e il fiasco di vino 6.",
    "solution_eng": "The hourglass in the first equation must correspond to a number that multiplied by itself make a single digit number. The second equation is made from the same number multiplied by the result of the first equation. The second result has 2 digits. Consequently the only number to satisfy this condition is the 3 that multiplied by 9 from 27.\nAt this point, making a few attempts, the third equation is also solved. Be carefull to the number alredy assigned to a symbol. The shield is worth 8 and the flask of wine 6."
  },
  {
    "number": 12,
    "name": "PERIMETRO",
    "text_ita": "Ogni mattina un giardiniere, prima di iniziare a lavorare, compie tre giri di corsa lungo il perimetro esterno di un cortile sterrato. Conoscendo le dimensioni di alcuni lati del giardino, sei in grado di calcolare quanti metri percorre ogni giorno il giardiniere?",
    "text_eng": "Every morning, before going to work, a gardener runs three laps along the outer perimeter of a courtyard. Knowing the length of some sides, would you know how many meters the gardener covers every day?",
    "hint1_ita": "Per risolvere questo rompicapo non e’ necessario conoscere le misure di ogni pezzo del perimetro. ",
    "hint2_ita": "Hai notato che i tre pezzi verticali del perimetro misurano 10 metri sommati insieme?",
    "hint3_ita": "La soluzione e’ 156!",
    "hint1_eng": "You don't need to know the measures of each piece of the perimeter to solve the puzzle.",
    "hint2_eng": "Did you notice that the three vertical pieces of the perimeter measure 10 meters added together?",
    "hint3_eng": "156 meters",
    "solution_ita": "La somma delle linee rosse è 10 metri, delle gialle 6 e delle blu 10. Conoscere la lunghezza di alcuni lati e’ stato utile.  ",
    "solution_eng": "The red lines measure 10 meters in total, the yellow ones 6 meters and the blue ones 10 meters. Knowing the length of some sides was useful."
  },
  {
    "number": 13,
    "name": "CAVALLI",
    "text_ita": "Il giovane stalliere ha dimenticato di spostare i cavalli del suo padrone dalla stalla alla città. I 4 cavalli che deve spostare hanno eta’ differenti quindi ognuno si muove a una velocita’ diversa, impiegando rispettivamente 1, 2, 4 e 5 ore per fare lo stesso tragitto. Lo stalliere deve spostarli in fretta, prima che il padrone lo scopra. Nel tragitto puo' portare solo due cavalli alla volta e uno gli servira’ per tornare indietro. Ovviamente, durante il viaggio deve adattarsi alla velocita’ del cavallo più lento. Quanto tempo impieghera’ per portare tutti i cavalli in citta’? Aiutalo a trovare la soluzione migliore, altrimenti il padrone si infuriera’!",
    "text_eng": "The young groom forgot to move his master's horses from the stable to the city. The 4 horses have different ages so each of them moves at a different speed, using respectively 1, 2, 4 and 5 hours to make the same journey. The groom must move them quickly, before the master finds out. On the way he can only carry two horses at a time and he will need one of the two to come back. Obviously, during the journey he must adapt to the speed of the slowest horse. How long will it take to bring all the horses into the city? Help him find the best solution, otherwise the master will be infuriated!",
    "hint1_ita": "Ricordati che il tuo obiettivo e’ ottimizzare i tempi, e’ importante tenere a mente il viaggio di ritorno.",
    "hint2_ita": "Non sempre conviene tornare con il cavallo più veloce.",
    "hint3_ita": "la soluzione e’ 12 ore. ",
    "hint1_eng": "Remember that your goal is to optimize time, it is important to keep in mind the return journey.",
    "hint2_eng": "It is not always advisable to return with the fastest horse.",
    "hint3_eng": "The solution is 12 hours.",
    "solution_ita": "Complimenti! Erroneamente si potrebbe pensare che per risparmiare tempo convenga portare sempre con se’ il cavallo più veloce. Invece, per ottimizzare i tempi, e’ necessario fare il primo viaggio con due cavalli più veloci, lasciando quello che impiega 1 ora. Dopo essere tornato con il cavallo da 2 ore, si prendono i cavalli piu' lenti (4 e 5 ore). Ora puoi tornare con il cavallo piu' veloce e prendere l'ultimo cavallo rimanente ",
    "solution_eng": "Congratulations! Mistakenly one might think that in order to save time you should always carry the fastest horse with you. Instead, to optimize time, it is necessary to make the first trip with the two fastest horses, leaving the one that takes 1 hour. After returning with the one that takes 2 hours, the slower horses move (4 and 5). So you can go back with the fastest one and then move the remaining."
  },
  {
    "number": 14,
    "name": "STREGA",
    "text_ita": "A volte, dietro ai numeri si nascondono dei segreti inimmaginabili. Sei in grado di decifrare il codice?",
    "text_eng": "Sometimes, unimaginable secrets are hidden behind the numbers. Can you crack the code?",
    "hint1_ita": "Cerca attentamente tutti i numeri nella scena.",
    "hint2_ita": "Prova a spostare il numero dell'enigma che si trova in alto a destra.",
    "hint3_ita": "La soluzione del codice e' il numero 23.",
    "hint1_eng": "Look carefully for all the numbers in the scene.",
    "hint2_eng": "Try moving the number of the riddle which is found at the top right corner.",
    "hint3_eng": "The solution is 23.",
    "solution_ita": "Complimenti! A volte serve uscire dagli schemi. Alla fine, il codice era una semplice addizione. Ma che fatica trovarlo!",
    "solution_eng": "Congratulations! Sometimes it is necessary to think out of the box. In the end the code was a simple addition. But what a struggle to find it!"
  },
  {
    "number": 15,
    "name": "CHIAVI",
    "text_ita": "Il capo della Gilda dei Ladri vuole mettere alla prova i suoi quattro seguaci. Organizza quindi una gara, disponendo 10 forzieri in fila indiana nella stanza del sotterraneo. Fornisce a ogni Ladro 2 chiavi: una argentata e una dorata. Prima di iniziare la gara, spiega attentamente le regole: “ogni Ladro ha due chiavi, ma un solo tentativo di aprire ciascun forziere. Ogni forziere puo’ essere aperto con una sola chiave. Quale sceglierai?”. Conoscendo quali sono le chiavi che hanno usato Lisa, Jack e Bob e il numero di casse aperte, sapresti dire quante casse e’ riuscito ad aprire Robb?",
    "text_eng": "The leader of the Thieves Guild wants to test his four followers. He then organizes a competition, arranging 10 chests in a straight line in the dungeon room. Gives each Thief 2 keys: a silver and a gold one. Before starting the race, he explains the rules carefully: \"each Thief has two keys, but only one attempt to open each chest. Each chest can be opened with only a key. Which one will you choose? \". Knowing which are the keys that Lisa, Jack and Bob used and the number of open crates, would you know how many crates Robb could open?",
    "hint1_ita": "Per risolvere il rompicapo dovresti confrontare le chiavi che hanno utilizzato gli altri tre scassinatori. Dato che Lisa ha aperto piu’ casse potresti confrontare le sue con quelle degli altri.",
    "hint2_ita": "Lisa, Jack e Bob hanno utilizzato le stesse chiavi per 4 casse, quindi almeno una delle 4 chiavi utilizzate non e’ sbagliata dato che Lisa e’ riuscita ad aprire 7 casse.",
    "hint3_ita": "La soluzione e’ 6.",
    "hint1_eng": "To solve the puzzle you should compare the keys that the other three burglars used. Since Lisa has opened more boxes you could compare hers with those of others.",
    "hint2_eng": "Lisa, Jack and Bob used the same keys for 4 crates, so at least one of the 4 keys used is not wrong since Lisa managed to open 7 of them.",
    "hint3_eng": "The solution is 6.",
    "solution_ita": "Questo era davvero difficile! Basandoti sui risultati delle 3 serie di forzieri puoi notare che tutti e 3 hanno fatto 4 scelte comuni, da qui si può dedurre che una di quelle 4 chiavi è giusta. Scegliendo a caso tra le 4 chiavi e ipotizzando che sia giusta si possono comporre 4 serie di chiavi risolutive, una per chiave scelta casualmente tra le 4. Non importa quale serie scegli. Robb é riuscito ad aprire 6 casse.",
    "solution_eng": "This was hard! Based on the outcomes of the 3 series of chests, you can see that each one of them has made 4 common choices, from which it can be deduced that one of those 4 keys is right. Choosing randomly between the 4 keys and assuming that it is the correct choice, you can compose 4 series of resolutive keys, one for each chosen key. It doesn't matter which series you choose. Robb managed to open 6 chests."
  },
{
"number": 16 ,
"name": "BIGLIE",
"text_ita": "In una stanza completamente buia vi sono 15 biglie rosse, 17 biglie gialle e 19 biglie blu. Qual è il numero minimo di biglie che devi prendere per avere sicuramente due biglie dello stesso colore?",
"text_eng": "In a completely dark room, there are 15 red marbles, 17 yellow marbles, and 19 blue marbles. What is the minimum number of marbles that you must take to certainly have two of them of the same color?",
"hint1_ita": "Concentrati su quanti tipi di biglie ci sono e non sul totale.",
"hint2_ita": "Servono veramente tutti questi numeri?",
"hint3_ita": "La risposta é 4.",
"hint1_eng": "Focus on how many types of marbles there are and not on the whole.",
"hint2_eng": "Do we really need all these numbers?",
"hint3_eng": "The answer is 4.",
"solution_ita": "Complimenti! Tutti quei numeri hanno come unica funzione quella di generare confusione, ma con te non ha funzionato. Dato che i tipi di biglia sono 3, basta prenderne 4 per avere sicuramente una doppione.",
"solution_eng": "Congratulations! All those numbers have the sole function of generating confusion, but it didn't work with you. Since there are 3 types of marble, it is enough to take 3 plus 1 to get a duplicate."
},
{
"number": 17 ,
"name": "OROLOGIO",
"text_ita": "Dalla stanza adiacente senti provenire un brusco rumore. Andando a controllare vedi che l'orologio e' caduto e si e' rotto in due parti. Con stupore noti che la somma di tutti gli orari da' lo stesso valore su entrambe le parti. Come si e' diviso l'orologio?",
"text_eng": "From the adjoining room, you hear a sudden noise. While checking, you see that the clock fell and broke into two parts. With astonishment, you notice the sum of all numbers gives the same value on both sides. How did the clock split?",
"hint1_ita": "Ti puo' dare un grande aiuto sommare tutti gli orari presenti sull'orologio.",
"hint2_ita": "Dato che la somma di tutti gli orari e' 78, ogni meta' deve avere come totale la meta' di 78, ovvero 39.",
"hint3_ita": "La linea divide tra il X e il IX, IV e III.",
"hint1_eng": "Adding up all the numbers on the clock could be very helpful.",
"hint2_eng": "Since the sum of all the numbers is 78, each half must have half the total of 78, or 39.",
"hint3_eng": "The line passes between the numbers X and IX and between IV and III.",
"solution_ita": "Bravissimo! Sommando tutti gli orari possiamo capire che ogni meta' deve avere come totale 39. Da qui basta proseguire per casi fino a trovare la risposta.",
"solution_eng": "Very good! Adding up all the numbers we can understand that each half must have a total of 39. From here it is sufficient to continue by case to find the answer."
},
{
"number": 18,
"name": "SPADA E FODERO",
"text_ita": "Un commerciante un po' dispettoso vende una spada e il suo fodero a 210 monete. Decidi pero' di comprare solo il fodero e il venditore invece di dirti direttamente il costo, ti dà due informazioni: Il costo della spada è di 200 monete in piu' rispetto al fodero e il fodero costa il prezzo totale degli oggetti meno il costo della spada. Quanto costa il fodero?",

"text_eng": "A spiteful merchant sells a sword and its scabbard for 210 coins. However, you decide to buy only the seller, instead of telling the cost directly, gives you two information: he sword costs 200 coins more than the sheath and he sheath costs the total price of the items minus the cost of the sword. How much does the scabbard cost?",
"hint1_ita": "Data la prima informazione la spada costa sicuramente piu' di 200 monete.",
"hint2_ita": "Date le informazioni si puo' impostare un sistema di equazioni. Occhio a non confonderti.",
"hint3_ita": "La risposta corretta e' 5.",
"hint1_eng": "Given the first information the sword definitely costs more than 200 coins.",
"hint2_eng": "Given the information you can set up a system of equations.",
"hint3_eng": "The answer is 5.",
"solution_ita": "Complimenti! Basta impostare un semplice sistema di equazioni con le informazioni date dal venditore.",
"solution_eng": "Congratulation! Just set up a simple system of equations with the information given by the seller."
},
{
"number": 19 ,
"name": "AMPOLLA",
"text_ita": "In un'ampolla c'è un batterio. Ogni minuto si duplica ed ognuna delle sue copie continua a duplicarsi a sua volta. Dopo 30 minuti l'ampolla è piena di batteri. Se invece di un batterio ce ne fossero stati due fin dall'inizio, dopo quanti minuti l'ampolla sarebbe stata piena di batteri?",
"text_eng": "In an ampoule there is a bacterium that doubles every minute and each copy of it continues to replicate itself. After 30 minutes the ampoule is full of bacteria. If instead of a bacterium there were two of them at the beginning, what is the time needed to fill the ampoule?",
"hint1_ita": "Non dare risposte affrettate, è facile cadere in errore. Rifletti sul fatto che ogni minuto i batteri raddoppiano.",
"hint2_ita": "Sono due le informazioni chiave: 1) Un batterio impiega 30 minuti a riempire l'ampolla. 2) Un batterio impiega un minuto per passare da 1 a 2 batteri.",
"hint3_ita": "La risposta e' 29",
"hint1_eng": "Don't give hasty answers, it's easy to fall into error. Think about the fact that every minute the bacteria double.",
"hint2_eng": "There are two key information: 1) A bacterium takes 30 minutes to fill the ampoule. 2) A bacterium takes a minute to pass from 1 to 2 bacteria.",
"hint3_eng": "The answer is 29",
"solution_ita": "Esatto! La saturazione avviene con solo un minuto in meno. Questo perche' un batterio impiega esattamente un minuto per raddoppiarsi.",
"solution_eng": "Exact! Saturation occurs with only one minute less. This is because a bacterium takes exactly one minute to double up."
},
{
"number": 20 ,
"name": "VINO",
"text_ita": "Dopo aver prodotto una grossa quantita' di vino, per festeggiare, 3 agricoltori locali decidono di bere parte della loro produzione. Al mattino seguente si accorgono di aver esagerato e dei 21 barili che avevano 7 sono vuoti, 7 pieni a meta' e 7 pieni completamente. Decidono di spartirsi i barili in modo tale che ognuno abbia la stessa quantita' di vino e barili. Sapresti aiutarli nella divisione?",
"text_eng": "After having produced a large quantity of wine, in order to celebrate, 3 local farmers decide to drink part of their production. On the following morning, they realize they have exaggerated and of the 21 barrels they had 7 are empty, 7 half full, 7 filled in. They decide to share the barrels so that everyone has the same amount of wine and barrels. Can you help them in the division?",
"hint1_ita": "Ogni agricoltore deve ricevere 3,5 litri di vino.",
"hint2_ita": "Uno dei 3 agricoltori ricevera' 3 barili vuoti, 1 mezzo e 3 pieni.",
"hint3_ita": "Agricoltore 1: 3 pieni, 1 mezzo, 3 vuoti. Agricoltore 2: 3 pieni, 1 mezzo, 3 vuoti. Agricoltore 3: 1 pieni, 5 mezzi, 1 vuoto",
"hint1_eng": "Each farmer must receive 3.5 liters of wine.",
"hint2_eng": "One of the 3 farmers will receive 3 empty barrels, 1 in half and 3 full ones.",
"hint3_eng": "Farmer 1: 3 full, 1 half, 3 empty. Farmer 2: 3 full, 1 half, 3 empty. Farmer 3: 1 full, 5 half, 1 empty.",
"solution_ita": "Dividendo per 3 la quantita' totale di barili e del vino rimanente, possiamo dedurre che ogni agricoltore deve ricevere 7 barili e 3,5 litri di vino. Facendo un po' di tentativi si puo' arrivare semplicemente alla soluzione.",
"solution_eng": "Dividing by 3 the number of barrels and the remaining wine, we can conclude that each farmer must receive 7 barrels and 3.5 liters of wine. By making a few attempts you can easily get to the solution."
},
{
"number": 21 ,
"name": "BILANCIA",
"text_ita": "Ci sono scatole di tre colori diversi, ogni colore determina il peso di ognuna. Nei primi due casi la bilancia è in equilibrio, quindi con quel numero di scatole di quel colore specifico si ha lo stesso peso su entrambi i piatti. Il terzo e ultimo caso sara' equo anche esso o pendera' a favore di un lato della bilancia? Se si quale? Premere in basso a destra dell'immagine il tasto relativo. ",
"text_eng": "There are boxes of three different colors, each color determines the weight of each box. In the first two cases, the balance is in equilibrium, so with that number of boxes of that specific color, the same weight is applied to both plates. Will the third and final case also be even or does it hang in favor of one side of the scale? If so, which one? Press button at the bottom right of the image.",
"hint1_ita": "I primi due casi sono fondamentali per la risoluzione del problema, ci permettono di impostare un'equivalenza che portera' alla soluzione.",
"hint2_ita": "Sostituiamo le 3 scatole viola con 2 scatole rosse e una blu (questa sostituzione e' possibile grazie al secondo caso), una volta completata la sostituzione guardiamo il primo caso. Sara' ora facile individuare la soluzione.",
"hint3_ita": "La bilancia pende verso sinistra.",
"hint1_eng": "The first two cases are essential for solving the problem, there are settings of an equivalence that will lead to the solution.",
"hint2_eng": "We replace the 3 purple boxes with 2 red and one blue boxes (this replacement is possible thanks to the second case), once the replacement is complete we look at the first case. The solution will be now easy to find.",
"hint3_eng": "The scale hangs to the left.",
"solution_ita": "Ottimo! Usando prima il secondo caso e infine il primo, puoi ricavare che sul piatto di sinistra vi e' una scatola blu in piu' ed e' proprio lei che causa la pendenza verso sinistra. ",
"solution_eng": "Great! Using the second case first and then the first one, you can find that on the left plate there is an extra blue box and that is the one which causes the slope to the left."
},
{
"number": 22 ,
"name": "EQUAZIONE",
"text_ita": "La prima riga ci mostra una semplice moltiplicazione, se sostituiamo il numero 1 con la lettera A e il numero 2 con la lettera B, possiamo riscrivere la stessa moltiplicazione con le lettere, come ci mostra l'esempio sottostante alla moltiplicazione. In blu vi e' un'altra moltiplicazione scritta usando le lettere, quali valori hanno A, B e C? Presta attenzione! la seconda moltiplicazione e' scollegata dalla prima: le lettere A e B potrebbero avere il valore 1 e 2.",
"text_eng": "The first line shows us a simple multiplication, if we replace the number 1 with the letter A and the number 2 with the letter B, we can rewrite the same multiplication with the letters, as the example below the multiplication. In blue there is another multiplication written using the letters, which values has A, B and C? Pay attention the second multiplication is disconnected from the first one, the letters A and B may or may not have the value 1 and 2.",
"hint1_ita": "La moltiplicazione avviene fra due numeri che sono entrambi formati della stessa cifra sia a destra che a sinistra. Vi sono in totale nove casi, inoltre se presti attenzione a un altro dettaglio potresti escluderli alcuni a priori.",
"hint2_ita": "Il dettaglio e' che la moltiplicazione da' come risultato un numero a 4 cifre, quindi puoi escludere tutte le moltiplicazioni che non soddisfano questo requisito fondamentale. ",
"hint3_ita": "A=8, B=7, C=4",
"hint1_eng": "The multiplication takes place between two numbers which are both formed of the same digit both on the right and on the left. There are a total of nine cases, furthermore if you pay attention to another detail you could exclude some a priori.",
"hint2_eng": "The detail is that the multiplication results in a 4-digit number, so you can exclude all multiplications that do not meet this fundamental requirement.",
"hint3_eng": "A=8, B=7, C=4",
"solution_ita": "Bravo! La moltiplicazione avviene fra due numeri che sono entrambi formati della stessa cifra sia a destra che a sinistra. Provando per casi si arriva alla soluzione, puoi inoltre accelerare il processo escludendo i numeri che moltiplicati fra loro danno come risultato un numero composto da 3 cifre. ",
"solution_eng": "Very good! The multiplication takes place between two numbers which are both formed of the same digit both on the right and on the left. Trying for cases we arrive at the solution, you can also speed up the process by excluding the numbers that multiplied together result in a 3-digit number."
},
{
"number": 23 ,
"name": "RGB",
"text_ita": "Ti viene chiesto di far funzionare uno strano meccanismo. Non sai molto sul suo funzionamento, ma devi comunque accendere le tre lampade sulla sinistra. Puoi andare avanti solo dopo esserci riuscito.",
"text_eng": "You are asked to make a strange mechanism work. You don't know much about how it works, but you were still asked to turn on the three lamps on the left. You can go on only after succeeding.",
"hint1_ita": "Ogni leva ha effetto solo dopo che il display in alto e' colorato come il filo a cui e' collegata la leva.",
"hint2_ita": "Dopo aver colorato il grosso display al centro del colore corrispettivo delle lampade premi il pulsante d'accensione sotto di esse.",
"hint3_ita": "Accendi le lampade.",
"hint1_eng": "Each lever has effect only after the top display is colored like the wire to which the lever is connected.",
"hint2_eng": "After having colored the large display in the center of the corresponding color of the lamps, press the ignition button below them.",
"hint3_eng": "Turn on the lamps.",
"solution_ita": "Alla fine bastava combinare i colori. Le leve servono a mandare l'impulso alle torce, ma puoi farlo solo dopo aver attivato il display in alto con il colore corrispettivo al filo da collegare. Complimenti! Ora puoi andare avanti.",
"solution_eng": "In the end it was enough to combine the colors. The levers are used to send the pulse to the torches, but you can do it only after activating the display at the top with the color corresponding to the wire to be connected. Kudos! Now you can go on."
},
{
"number": 24 ,
"name": "MELE",
"text_ita": "Un'anziana signora va bussando per le case per vendere mele. Alla signora della prima casa vende la metà delle mele che ha nel suo canestro piu' mezza mela. A quella della seconda casa vende la metà delle mele rimaste nel canestro piu' mezza mela. A quella della terza e ultima casa vende la metà delle mele rimaste piu' mezza mela. A questo punto il canestro è vuoto. Quante mele c'erano all'inizio?",
"text_eng": "An old lady is wandering in the neighborhood to sell apples. To the lady of the first house, she sells half of the apples she has in her basket plus half an apple. The second house, she sells half of the apples left in the basket plus half an apple. To that of the third and last house, sells half of the apples left plus half an apple. At this point the basket is empty. How many apples were there at the beginning?",
"hint1_ita": "Puo' rivelarsi utile partire dalla fine, piuttosto che dall'inizio.",
"hint2_ita": "La signora della terza casa ha comprato una mela.",
"hint3_ita": "Le mele iniziali sono 7.",
"hint1_eng": "It may be useful to start from the end rather than from the beginning.",
"hint2_eng": "The lady of the third house bought an apple.",
"hint3_eng": "The answer is 7.",
"solution_ita": "Esatto! Ad ogni visita vanno messe nel canestrino il doppio delle mele relative alla visita precedente piu' 1. In questo specifico caso, dove le visite sono 3, le mele iniziali sono 7. ",
"solution_eng": "Exactly! At each visit, double the amount of apples relating to the previous visit + one more must be placed in the basket."
},
{
"number": 25 ,
"name": "TERRENO",
"text_ita": "Tre abitazioni hanno un cortile interno in comune. I corrispettivi 3 inquilini decidono di sistemare il giardino per renderlo piu' gradevole. Uno dei 3 si ammala, e lascia fare il lavoro ai 2 rimanenti. Il primo inquilino lavora 5 giorni, il secondo 4. Al termine dei lavori il terzo decide di pagare gli altri due in proporzione al lavoro svolto, dandogli in totale 9 monete d'oro. Quante monete prendera' l'inquilino che ricevera' il compenso maggiore?",
"text_eng": "Three homes have a shared inner courtyard. The corresponding 3 tenants decide to arrange the garden to make it more pleasant. One of the 3 loves it, and lets the remaining 2 do the work. The first tenant works 5 days, the second 4. At the end of the work the third decides to pay the other two in proportion to the work done, giving him a total of 9 gold coins. How many coins will the tenant with the hightest compensation get?",
"hint1_ita": "Non lasciarti confondere dai giorni. La paga e' in proporzione solo alla parte di terreno che non appartiene a nessuno dei due lavoratori.",
"hint2_ita": "Cerca di capire quanti giorni di lavoro ci sono voluti per sistemare ogni terzo del terreno.",
"hint3_ita": "Riceve 6 monete.",
"hint1_eng": "Don't be confused by the days. The pay is in proportion only to the part of the land that does not belong to either of the two workers..",
"hint2_eng": "Try to figure out how many days of work it took to fix every third of the land.",
"hint3_eng": "It receives 6 coins.",
"solution_ita": "Per calcolare quanto viene pagato l'inquilino con il guadagno maggiore conviene calcolare quanto tempo è necessario per sistemare ogni terzo di terreno, ovvero 3 giorni. Da qui puoi capire che il primo inquilino ha lavorato 2 giorni al terreno non suo, mentre il secondo 1. In rapporto 2:1 il primo otterrà 6 monete e il secondo 3.",
"solution_eng": "To calculate how much the tenant with the biggest gain is paid, it is worth calculating how long it takes to get every third of the land, or 3 days. From here you can understand that the first tenant worked 2 days on the land that doesn't belong to him, while the second only 1 day. In a 2: 1 ratio the first will get 6 coins and the second 3."
},
{
"number": 26,
"name": "LOCO",
"text_ita": "Sei in grado di usare questo strano dispositivo per interpretare il codice scritto sotto di esso?",
"text_eng": "Are you able to use this strange device to interpret the code written below it?",
"hint1_ita": "Potrebbe sembrare una scritta, ma il codice e' composto solo da simboli.",
"hint2_ita": "Ogni simbolo del codice indica un tasto del dispositivo.",
"hint3_ita": "Clicca qui per risolvere.",
"hint1_eng": "It may seem like an inscription, but the code is composed only of symbols.",
"hint2_eng": "Each symbol in the code indicates a key on the device",
"hint3_eng": "Click here to solve.",
"solution_ita": "Sei riuscito a farlo funzionare, bravo! I simboli rappresentano la cella nella griglia 3x3 da premere. Per trovare la corrispondenza basta vedere le linee attorno alle rune.",
"solution_eng": "You managed to make it work, bravo! The symbols represent the cell in the 3x3 grid to be pressed. To find the match just look at the lines around the runes."
},
{
"number": 27 ,
"name": "SCATOLA",
"text_ita": "Un libro e una scatola hanno le seguenti dimensioni. Un libro e' lungo  10cm, largo 5cm e alto 10cm. La scatola e' larga, lunga e alta 15cm. Conoscendo le dimensioni, quanti libri al massimo possono entrare nella scatola?",
"text_eng": "A book and a box have the following dimensions. The book is 10cm long, 5cm wide and 10cm high. The box is 15 cm wide, long and high. Knowing the size, how many books can fit in the box?",
"hint1_ita": "Puo' aiutare molto contare quanti libri possono entrare al massimo nella scatola senza restrizioni sulla forma. Conta il volume totale della scatola e dividilo per il volume di un singolo libro.",
"hint2_ita": "Il massimo numero di libri che puo' contenere la scatola e' 6. Entranno tutti in qualche modo?",
"hint3_ita": "Entreranno al massimo 6 libri.",
"hint1_eng": "It can help a lot to count how many books can enter the box at most without form restrictions. Count the total volume of the box and divide it by the volume of a single book.",
"hint2_eng": "The maximum number of books that can hold the box is 6. Will they all fit in some way?",
"hint3_eng": "The answer is 6.",
"solution_ita": "Bravissimo! Dentro la scatola entrano esattamente 6 libri. Si riesce a formare un cubo di lato 15x15x15 che ha 3 cubi 5x5x5 vuoti: uno in alto a destra, uno centrale e infine l'ultimo nella posizione opposta al primo.",
"solution_eng": "Very good! Exactly 6 books will fit in the box. It is possible to form a cube on the side 15x15x15 which has 3 empty 5x5x5 cubes: one in the upper right corner, a central one and finally the last one in the opposite position to the first one."
},
{
"number": 28 ,
"name": "DADI",
"text_ita": "Mettendo in fila questi dadi e' possibile generare una precisa successione. Quale delle quattro possibili disposizioni continua questa sequenza?",
"text_eng": "By putting these dices together, it is possible to generate a precise sequence. Which of the four possible arrangements continues this sequence?",
"hint1_ita": "E' possibile individuare una precisa sequenza di numeri, sei in grado di trovarla?",
"hint2_ita": "Guarda solamente i pallini neri nella parte alta dei dadi, non serve vedere il dado nel suo insieme.",
"hint3_ita": "La risposta giusta e' il dado con 6 pallini orizzontali",
"hint1_eng": "It is possible to identify a precise sequence of numbers, are you able to find it?.",
"hint2_eng": "Just look at the black dots at the top of the dice, you don't need to see the dice as a whole.",
"hint3_eng": "The right answer is the roll with 6 horizontal dots.",
"solution_ita": "I pallini in alto dei dadi nascondono una sequenza. Con il dado scelto, la sequenza puo' continuare fino al numero 6.",
"solution_eng": "The dots at the top of the dice hide a sequence. With the chosen die, the sequence can continue up to the number 6."
},
{
"number": 29 ,
"name": "PERGAMENA",
"text_ita": "Una strana pergamena magica reagisce all'inchiostro. Solo quando sarai riuscito ad attivarla potrai usare l'incantesimo che ti portera' al prossimo enigma.",
"text_eng": "A strange magic scroll reacts to ink. Only when you are able to COMPLETELY activate it will you be able to use the spell that will take you to the next puzzle.",
"hint1_ita": "Se non riesci a usare l'inchiostro accanto alla pergamena, cerca nel menu sulla destra. Trovato qualcosa?",
"hint2_ita": "Ricordati di usare tutti i tipi di inchiostro. Non basta quello nero.",
"hint3_ita": "Completa pergamena.",
"hint1_eng": "If you can't use the ink next to the parchment, look in the menu on the right. Found anything?.",
"hint2_eng": "Remember to use all types of ink. The black one won't be enough.",
"hint3_eng": "Complete parchment.",
"solution_ita": "Sei riuscito a capire l'inganno. Dovevi usare la lavagnetta degli appunti per attivare la pergamena. Hai visto quanti bei colori abbiamo messo? Lo sappiamo... manca la gomma, ma metteremo anche quella.",
"solution_eng": "You managed to understand the deception. You had to use the clipboard to activate the parchment. Did you see how many beautiful colors we put on? We know ... rubber is missing, but we'll put that too."
},
{
"number": 30 ,
"name": "BANDIERA",
"text_ita": "Il capo di una piccola tribu' ha deciso di creare uno stendardo che caratterizzi il suo clan. Dividendo lo stendardo in tre parti di grandezza non variabile, quanti tipi diversi di stendardi e' possibile ottenere utilizzando 3 tinture? Ogni zona deve essere di un solo colore. Inoltre non possono esserci 2 colori uguali vicini.",
"text_eng": "The head of a small has decided to create a banner that characterizes his clan. By dividing the banner into three sections, of variable size, how many different types of banners can be obtained using 3 colors if each zone can have a different color, without there being more than 2 adjacent ones?",
"hint1_ita": "Non serve provare con tutti i colori, basta trovare il numero di combinazioni con un colore e poi moltiplicarle per il numero di colori totali.",
"hint2_ita": "Anche il bianco e' un colore della bandiera.",
"hint3_ita": "Le combinazioni totali sono 36.",
"hint1_eng": "There is no need to try all the colors, just find the number of combinations with one color and then multiply them by the total number of colors.",
"hint2_eng": "Even white is a flag color.",
"hint3_eng": "Overall there are 36 combinations",
"solution_ita": "Avevi considerato da subito il bianco nei tuoi calcoli? Aggiungendo quello sono 36 i tipi di bandiere diverse che il capo tribu' puo' creare. Iniziando da un colore si possono avere 9 combinazioni diverse. Per un totale di 4 colori abbiamo 36 combinazioni.",
"solution_eng": "Did you immediately consider white in your calculations? Adding that, there are 36 different types of flags that the tribal leader may create. Starting from one colore you can create 9 different combination. With 4 colours we have 36 combination."
}
]
