[
  {
    "number": 1,
    "name": "Alberi",
    "text_ita": "Una strana griglia 3x3 raffigura diversi alberi, purtroppo manca l’ultimo tassello in basso a destra. Sembra seguire uno schema, quale tassello e’ quello giusto?",
    "text_eng": "Insert text.",
    "hint1_ita": "L’unico elemento che non segue uno schema e’ il colore del tronco.",
    "hint2_ita": "Concentrati su tutti gli altri elementi: luci, la decorazione in cima e le palle di natale.",
    "hint3_ita": "La soluzione e' il tassello C",
    "hint1_eng": "prova",
    "hint2_eng": "prova",
    "hint3_eng": "prova",
    "solution_ita": "Bravo! Le luci, le decorazioni in cima e le palle di natale non si ripetono mai, sapendo questo ti basta conoscere solo due alberi per dedurre come sara' il terzo.",
	"solution_eng": "prova"
  },
   {
    "number": 2,
    "name": "Batteria",
    "text_ita": "Accendendo questo macchinario e' possibile trovare la password per accedere al database dove l'aiutante di Babbo Natale ha salvato tutte le consegne da fare il 25 dicembre. Tuttavia non sembra esserci energia sufficiente per farlo funzionare, sai aiutarlo?",
    "text_eng": "Insert text.",
	"hint1_ita": "Hai una fonte di energia a cui collegare il macchinario?",
    "hint2_ita": "La lettera A  = 65, B = 66, C = 67 e cosi' via fino a Z.",
    "hint3_ita": "Hai attaccato il cellulare alla presa di corrente? La password e' 4.",
    "hint1_eng": "prova",
    "hint2_eng": "prova",
    "hint3_eng": "prova",
    "solution_ita": "Dopo aver collegato il cellulare alla presa di corrente puoi osservare sul display il codice O-K. Ogni lettera partendo da A corrisponde a un numero, come faceva intendere la pergamena in alto a destra. La A=65, B=66, C=67 e cosi' via. In questo modo O=79 e K=75. 78-75=4. La password e' quindi 4.",
	"solution_eng": "prova"
  },
  {
    "number": 3,
    "name": "Elfo",
    "text_ita": "L’elfo del natale deve entrare nella casa di Babbo Natale per prendere le chiavi della slitta. Arrivato davanti alla porta, inserisce il numero nella sequenza, ma e' errato. Puoi aiutare l’elfo a ricordare il numero mancante, sapendo che la sequenza segue un preciso schema.",
    "text_eng": "Insert text.",
    "hint1_ita": "Hai provato a vederli come giorni?",
    "hint2_ita": "Forse e' a cavallo tra due giorni",
    "hint3_ita": "Il numero mancante e' 1",
    "hint1_eng": "prova",
    "hint2_eng": "prova",
    "hint3_eng": "prova",
    "solution_ita": "Complimenti! Se guardi attentamente i numeri non rappresentano niente altro che un mese e un giorno. Si inizia dal 31 di Dicembre e poi si va avanti, 1 Gennaio, 2 Gennaio e infine 3 Gennaio.",
	"solution_eng": "prova"
  },
   {
    "number": 4,
    "name": "Pacchi",
    "text_ita": "Babbo natale ha incaricato il suo aiutante di preparare un pacco regalo. Babbo tiene molto ai suoi regali e raramente affida un compito cosi' delicato ad altri, ma ogni volta che si trova costretto a farlo, consegna una lista dettagliatissima con tutte le specifiche che il pacco deve avere. Aiutiamo l’aiutante a ricoprire questa importante mansione senza commettere errori.",
    "text_eng": "Insert text.",
    "hint1_ita": "Credo che la corrente della casa non ci sia, cosa possiamo fare?",
    "hint2_ita": "Delle volte per aver maggior chiarezza su un problema bisogna cambiare il punto di vista.",
    "hint3_ita": "Clicca qui per la soluzione",
    "hint1_eng": "prova",
    "hint2_eng": "prova",
    "hint3_eng": "prova",
    "solution_ita": "Complimenti! Una volta fornita la corrente e posizionato il pacco al centro del tavolo, basta cambiare il colore del fiocco usando la lavagnetta e il colore della scatola con il pulsante sotto il tavolo nascosto dal fiocco. Ovviamente modificando la scotola giusta che si ottiene girando lo schermo.",
	"solution_eng": "prova"
  }
]